# Pandas
### 자료구조 : Series  and Dataframe
Pandas에서 제공하는 데이터 자료구조는 Series와 Dataframe 두가지가 존재한다.<br/>
Series는 시계열과 유사한 데이터로서 index와 value가 존재하고<br/>
Dataframe은 딕셔너리데이터를 매트릭스 형태로 만들어 준 것 같은 frame을 가지고 있다.<br/>
이런 데이터 구조를 통해 시계열, 비시계열 데이터를 통합하여 다룰 수 있다.

### Series

In [1]:
import pandas as pd
from pandas import Series, DataFrame

In [2]:
fruit = Series([2500, 3800, 1200, 6000],
              index=['apple', 'banana', 'cherry', 'dragon-fruit'])
fruit

apple           2500
banana          3800
cherry          1200
dragon-fruit    6000
dtype: int64

#### index, values 추출

In [3]:
print(fruit.values)

[2500 3800 1200 6000]

In [4]:
print(fruit.index)

Index(['apple', 'banana', 'cherry', 'dragon-fruit'], dtype='object')

#### Series와 dictionary의 데이터 구조 자체는 매우 다르지만 유사하다.
dictionary로 만들어서 Series로 변환할 수 있다.

In [5]:
fruitData = {'apple': 2500, 'banana' : 3800, 'cherry' : 1200, 'dragon-fruit':6000}
fruit = Series(fruitData)
fruit

apple           2500
banana          3800
cherry          1200
dragon-fruit    6000
dtype: int64

In [6]:
type(fruitData)

dict

index에 해당하는 fruitName이 index위에 지정이 되고 value의 역할인 fruitPrice는 아래에서 표출된다.

In [7]:
fruit.name = 'fruitPrice'
fruit.index.name = 'fruitName'

In [8]:
fruit

fruitName
apple           2500
banana          3800
cherry          1200
dragon-fruit    6000
Name: fruitPrice, dtype: int64

# Dataframe

In [9]:
fruitData = {'fruitName':['apple','banana','cherry','dragon-fruit'],
            'fruitPrice':[2500, 3800, 1200, 6000],
            'num':[10, 5, 3, 8]}
fruitData

{'fruitName': ['apple', 'banana', 'cherry', 'dragon-fruit'],
 'fruitPrice': [2500, 3800, 1200, 6000],
 'num': [10, 5, 3, 8]}

fruitName에 과일이름 index가 들어가고,<br/>
fruitPrice에 과일이름 index의 가격이 들어갔다.<br/>
num은 과일이 지금 몇개 있는 지 나타낸다.<br/>

In [10]:
fruitFrame = DataFrame(fruitData)
fruitFrame

      fruitName  fruitPrice  num
0         apple        2500   10
1        banana        3800    5
2        cherry        1200    3
3  dragon-fruit        6000    8

#### 컬럼순서 지정하기

In [11]:
fruitFrame = DataFrame(fruitData, columns = ['fruitPrice', 'num', 'fruitName'])

In [12]:
fruitFrame

   fruitPrice  num     fruitName
0        2500   10         apple
1        3800    5        banana
2        1200    3        cherry
3        6000    8  dragon-fruit

#### Dataframe의 특정항목 추출하기

In [13]:
fruitFrame['fruitName']

0           apple
1          banana
2          cherry
3    dragon-fruit
Name: fruitName, dtype: object

#### 속성형식으로 추출하기

In [14]:
fruitFrame.fruitName

0           apple
1          banana
2          cherry
3    dragon-fruit
Name: fruitName, dtype: object

#### Dataframe에 컬럼 추가하기

In [15]:
fruitFrame['Year'] = [1111, 2222, 3333, 4444]

In [16]:
fruitFrame

   fruitPrice  num     fruitName  Year
0        2500   10         apple  1111
1        3800    5        banana  2222
2        1200    3        cherry  3333
3        6000    8  dragon-fruit  4444

데이터 프레임은 데이터를 추가할 때 새로운 컬럼을 정해서 데이터만 넣어주면 추가가 되는 점이 편리하다!

In [17]:
variable = Series([4, 2, 1], index=[0, 2, 3])

In [18]:
variable

0    4
2    2
3    1
dtype: int64

In [19]:
fruitFrame['stock'] = variable
# 0,2,3 인덱스에 값을 Series로 넣어준다.

In [20]:
fruitFrame

   fruitPrice  num     fruitName  Year  stock
0        2500   10         apple  1111    4.0
1        3800    5        banana  2222    NaN
2        1200    3        cherry  3333    2.0
3        6000    8  dragon-fruit  4444    1.0

#### Series 데이터의 row 삭제

In [21]:
fruit = Series([2500, 3800, 1200, 6000], index=['apple', 'banana', 'cherry', 'dragon-fuit'])
fruit

apple          2500
banana         3800
cherry         1200
dragon-fuit    6000
dtype: int64

In [22]:
new_fruit = fruit.drop('banana')
new_fruit

apple          2500
cherry         1200
dragon-fuit    6000
dtype: int64

#### Dataframe row 삭제하기

In [23]:
fruitData = {'fruitName': ['apple', 'banana', 'cherry', 'dragon-fruit'],
             'fruitPrice': [2500, 3800, 1200, 6000],
             'num': [10, 5, 3, 8]}
fruitData

{'fruitName': ['apple', 'banana', 'cherry', 'dragon-fruit'],
 'fruitPrice': [2500, 3800, 1200, 6000],
 'num': [10, 5, 3, 8]}

In [24]:
fruitName = fruitData['fruitName']

In [25]:
fruitName

['apple', 'banana', 'cherry', 'dragon-fruit']

index를 직관적으로 변경

In [26]:
fruitFrame = DataFrame(fruitData,
                       index = fruitName,
                       columns = ['fruitPrice','num'])

In [27]:
fruitFrame

              fruitPrice  num
apple               2500   10
banana              3800    5
cherry              1200    3
dragon-fruit        6000    8

In [28]:
fruitFrame2 = fruitFrame.drop(['apple', 'banana'])

In [29]:
fruitFrame2

              fruitPrice  num
cherry              1200    3
dragon-fruit        6000    8

#### Dataframe column 삭제

In [30]:
fruitFrame3 = fruitFrame.drop('num', axis=1) # axis=1 은 컬럼을 뜻함
fruitFrame3

              fruitPrice
apple               2500
banana              3800
cherry              1200
dragon-fruit        6000

row 삭제와 마찬가지로 여러개의 컬럼을 삭제하려면 리스트형태로 값을 지정하면 된다 ['num', 'fruitPrice']

### 항목 추출하기

In [63]:
fruit = Series([2500,3800,1200,6000],index=['apple','banana','cherry','dragon-fruit']) 
fruit['apple':'banana']

apple     2500
banana    3800
dtype: int64

In [64]:
fruitFrame['apple':'banana']

        fruitPrice  num
apple         2500   10
banana        3800    5

### Data의 기본 연산
Series의 연산

In [66]:
fruit1 = Series([5, 9, 10, 3], index =['apple', 'banana', 'dragon-fruit', 'cherry'])
fruit2 = Series([3, 2, 6, 8, 10], index =['mango', 'orange', 'grape', 'cherry', 'apple'])

In [34]:
fruit1 + fruit2

apple           15.0
banana           NaN
cherry          18.0
dragon-fruit     NaN
grape            NaN
mango            NaN
orange           NaN
dtype: float64

#### Dataframe의 연산

In [67]:
cityData1 = {'Ohio' : [4,8,3,5],'Texas' : [0,1,2,3]}
cityFrame1 = DataFrame(cityData1,columns=['Ohio','Texas'],index = ['apple','banana','cherry','dragon-fruit'])
cityData2 = {'Ohio' : [3,0,2,1,7],'Colorado':[5,4,3,6,0]}
cityFrame2 = DataFrame(cityData2,columns =['Ohio','Colorado'],index = ['apple','orange','banana','cherry','mango'])

In [68]:
cityFrame1

              Ohio  Texas
apple            4      0
banana           8      1
cherry           3      2
dragon-fruit     5      3

In [69]:
cityFrame2

        Ohio  Colorado
apple      3         5
orange     0         4
banana     2         3
cherry     1         6
mango      7         0

In [70]:
cityFrame1 + cityFrame2

              Colorado  Ohio  Texas
apple              NaN   7.0    NaN
banana             NaN  10.0    NaN
cherry             NaN   4.0    NaN
dragon-fruit       NaN   NaN    NaN
mango              NaN   NaN    NaN
orange             NaN   NaN    NaN

NaN이 하나라도 존재하는 row는 모두 NaN 처리가 된다.

### 데이터의 정렬
Series의 정렬

In [71]:
fruit = Series([2500,3800,1200,6000],index=['apple','banana','cherry','dragon-fruit'])

In [72]:
fruit.sort_values()
fruit.sort_values(ascending=False) # 내림차순

dragon-fruit    6000
banana          3800
apple           2500
cherry          1200
dtype: int64

In [79]:
fruit.sort_index(ascending=False)

dragon-fruit    6000
cherry          1200
banana          3800
apple           2500
dtype: int64

Dataframe의 정렬

In [77]:
fruitData = {'fruitName':['apple','banana','cherry','dragon-fruit'], 
             'fruitPrice':[2500,3800,6000,1200],
             'num':[10,5,3,8]}

In [80]:
fruitName = fruitData['fruitName']

In [82]:
fruitFrame = DataFrame(fruitData, index = fruitName, columns = ['num','fruitPrice'])
fruitFrame

              num  fruitPrice
apple          10        2500
banana          5        3800
cherry          3        6000
dragon-fruit    8        1200

In [83]:
fruitFrame.sort_index()

              num  fruitPrice
apple          10        2500
banana          5        3800
cherry          3        6000
dragon-fruit    8        1200

In [84]:
fruitFrame.sort_index(axis = 1) # 행 정렬

              fruitPrice  num
apple               2500   10
banana              3800    5
cherry              6000    3
dragon-fruit        1200    8

#### Dataframe 값 정렬
기준을 여러 컬럼으로 하고 싶을 때는 by 안에 리스트에 여러개의 컬럼 이름을 지정하면 된다.

In [85]:
fruitFrame.sort_values(by=['num', 'fruitPrice'])

              num  fruitPrice
cherry          3        6000
banana          5        3800
dragon-fruit    8        1200
apple          10        2500

In [45]:
fruitFrame.sort_values(by=['num'])

              fruitPrice  num
cherry              1200    3
banana              3800    5
dragon-fruit        6000    8
apple               2500   10

# scikit-learn에 pandas 활용하기

#### 기술통계량 관련 함수
<img src='images/numpy-5.png' width=400 style="float:left">

German credit data 입력

In [46]:
german = pd.read_csv('http://freakonometrics.free.fr/german_credit.csv')

In [47]:
german

,Creditability,Account Balance,Duration of Credit (month),Payment Status of Previous Credit,Purpose,Credit Amount,Value Savings/Stocks,Length of current employment,Instalment per cent,Sex & Marital Status,...,Duration in Current address,Most valuable available asset,Age (years),Concurrent Credits,Type of apartment,No of Credits at this Bank,Occupation,No of dependents,Telephone,Foreign Worker
0,1,1,18,4,2,1049,1,2,4,2,...,4,2,21,3,1,1,3,1,1,1
1,1,1,9,4,0,2799,1,3,2,3,...,2,1,36,3,1,2,3,2,1,1
2,1,2,12,2,9,841,2,4,2,2,...,4,1,23,3,1,1,2,1,1,1
3,1,1,12,4,0,2122,1,3,3,3,...,2,1,39,3,1,2,2,2,1,2
4,1,1,12,4,0,2171,1,3,4,3,...,4,2,38,1,2,2,2,1,1,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,0,1,24,2,3,1987,1,3,2,3,...,4,1,21,3,1,1,2,2,1,1
996,0,1,24,2,0,2303,1,5,4,3,...,1,1,45,3,2,1,3,1,1,1
997,0,4,21,4,0,12680,5,5,4,3,...,4,4,30,3,3,1,4,1,2,1
998,0,2,12,2,3,6468,5,1,2,3,...,1,4,52,3,2,1,4,1,2,1
999,0,1,30,2,2,6350,5,5,4,3,...,4,2,31,3,2,1,3,1,1,1

In [48]:
list(german.columns.values)  # 어떤 컬럼들이 있는지 확인

['Creditability',
 'Account Balance',
 'Duration of Credit (month)',
 'Payment Status of Previous Credit',
 'Purpose',
 'Credit Amount',
 'Value Savings/Stocks',
 'Length of current employment',
 'Instalment per cent',
 'Sex & Marital Status',
 'Guarantors',
 'Duration in Current address',
 'Most valuable available asset',
 'Age (years)',
 'Concurrent Credits',
 'Type of apartment',
 'No of Credits at this Bank',
 'Occupation',
 'No of dependents',
 'Telephone',
 'Foreign Worker']

In [91]:
german_sample = german[['Creditability', 'Duration of Credit (month)', 'Purpose', 'Credit Amount']]

In [92]:
german_sample

     Creditability  Duration of Credit (month)  Purpose  Credit Amount
0                1                          18        2           1049
1                1                           9        0           2799
2                1                          12        9            841
3                1                          12        0           2122
4                1                          12        0           2171
..             ...                         ...      ...            ...
995              0                          24        3           1987
996              0                          24        0           2303
997              0                          21        0          12680
998              0                          12        3           6468
999              0                          30        2           6350

[1000 rows x 4 columns]

In [93]:
german_sample.min()

Creditability                   0
Duration of Credit (month)      4
Purpose                         0
Credit Amount                 250
dtype: int64

In [94]:
german_sample.max()

Creditability                     1
Duration of Credit (month)       72
Purpose                          10
Credit Amount                 18424
dtype: int64

In [95]:
german_sample.mean()

Creditability                    0.700
Duration of Credit (month)      20.903
Purpose                          2.828
Credit Amount                 3271.248
dtype: float64

In [97]:
#요약통계
german_sample.describe

<bound method NDFrame.describe of      Creditability  Duration of Credit (month)  Purpose  Credit Amount
0                1                          18        2           1049
1                1                           9        0           2799
2                1                          12        9            841
3                1                          12        0           2122
4                1                          12        0           2171
..             ...                         ...      ...            ...
995              0                          24        3           1987
996              0                          24        0           2303
997              0                          21        0          12680
998              0                          12        3           6468
999              0                          30        2           6350

[1000 rows x 4 columns]>

# 상관관계와 공분산

공분산 : X의 편차와 Y의 편차를 곱한 것의 평균, X와 Y의 단위에 영향을 받는다.<br/>
상관계수 : 확률변수의 절대적 크기에 영향을 받지 않도록 단위화, 분산의 크기만큼 나눔

In [98]:
german_sample = german[['Duration of Credit (month)', 'Credit Amount', 'Age (years)']]

In [100]:
# 상관계수
german_sample.corr()

,Duration of Credit (month),Credit Amount,Age (years)
Duration of Credit (month),1.000000,0.624988,-0.037550
Credit Amount,0.624988,1.000000,0.032273
Age (years),-0.037550,0.032273,1.000000

In [101]:
# 공분산
german_sample.cov()

,Duration of Credit (month),Credit Amount,Age (years)
Duration of Credit (month),145.415006,2.127401e+04,-5.140567
Credit Amount,21274.007063,7.967927e+06,1034.202787
Age (years),-5.140567,1.034203e+03,128.883119

In [55]:
german_sample = german[['Credit Amount', 'Type of apartment']]

In [56]:
german_sample

     Credit Amount  Type of apartment
0             1049                  1
1             2799                  1
2              841                  1
3             2122                  1
4             2171                  2
..             ...                ...
995           1987                  1
996           2303                  2
997          12680                  3
998           6468                  2
999           6350                  2

[1000 rows x 2 columns]

## 핵심기능 Group by

Group by는 데이터를 구분 할 수 있는 컬럼의 값들을 이용하여<br/>
데이터를 여러 기준에 의해 구분 한 뒤 계산 및 순회 등 함수의 계산을 할 수 있는 방법이다.<br/>
이런 Group by를 통해 계산하고 반복문을 활용하는 방법을 설명한다.

한 개 그룹 요약 통계

In [103]:
german_sample = german[['Credit Amount', 'Type of apartment']]

In [104]:
german_sample

     Credit Amount  Type of apartment
0             1049                  1
1             2799                  1
2              841                  1
3             2122                  1
4             2171                  2
..             ...                ...
995           1987                  1
996           2303                  2
997          12680                  3
998           6468                  2
999           6350                  2

[1000 rows x 2 columns]

In [58]:
german_grouped = german_sample['Credit Amount'].groupby(german_sample['Type of apartment'])
german_grouped
# group으로 뭐할 건지 명시해줘야 한다.

In [59]:
# 각 그룹별로 평균값이 나온다.
german_grouped.mean()

Type of apartment
1    3122.553073
2    3067.257703
3    4881.205607
Name: Credit Amount, dtype: float64

In [60]:
german_sample = german[['Credit Amount', 'Type of apartment', 'Purpose']]

In [61]:
german_grouped = german_sample['Credit Amount'].groupby([german_sample['Purpose'], german_sample['Type of apartment']])
#첫번째 조건 Purpose, 두번째 조건 Type of apartment

In [106]:
german_grouped.mean()

Purpose  Type of apartment
0        1                    2597.225000
         2                    2811.024242
         3                    5138.689655
1        1                    5037.086957
         2                    4915.222222
         3                    6609.923077
2        1                    2727.354167
         2                    3107.450820
         3                    4100.181818
3        1                    2199.763158
         2                    2540.533040
         3                    2417.333333
4        1                    1255.500000
         2                    1546.500000
5        1                    1522.000000
         2                    2866.000000
         3                    2750.666667
6        1                    3156.444444
         2                    2492.423077
         3                    4387.266667
8        1                     902.000000
         2                    1243.875000
9        1                    5614.125000
         2                    3800.592105
         3                    4931.800000
10       2                    8576.111111
         3                    7109.000000
Name: Credit Amount, dtype: float64

그룹을 두가지 이상으로 정하고 싶으면 리스트를 통해 그룹을 두가지 이상으로 만들 면 된다.